[
  {
    "id": 1,
    "title": "Western Star Resources Inc. Announces Appointment of New CFO & Director",
    "date": "March 7, 2023",
    "content": "Western Star Resources Inc, is announcing the resignation of Anthony Chan, CFO, and Ming Chang, director, of the Company and is pleased to announce the appointment of a new CFO, Monty Sutton, and Director, Justin Corinella.",
    "url": "/western-star-appoints-new-cfo-director"
  },
  {
    "id": 2,
    "title": "Western Star Resources Corp. Announces Entry into Agreement to Acquire Toad River Copper-Cobalt Property and Announces Grant of Incentive Awards",
    "date": "July 20, 2023",
    "content": "Western Star Resources Corp is pleased to announce that it has entered into an agreement to acquire the Toad River Copper-Cobalt property located in the Peace River North area of British Columbia.",
    "url": "/western-star-enters-agreement-to-acquire-toad-river"
  },
  {
    "id": 3,
    "title": "Western Star Resources Inc. Closes Acquisition of Toad River Copper-Cobalt Property",
    "date": "August 24, 2023",
    "content": "Western Star Resources Inc. is pleased to announce the closing of the Toad River Copper-Cobalt Property located Peace River North area of British Colombia.",
    "url": "/western-star-closes-toad-river-acquisition"
  },
  {
    "id": 4,
    "title": "Western Star Resources Enters Into Investment and Advisory Agreement With Crescita Capital for $5 Million in Equity Capital",
    "date": "September 12, 2023",
    "content": "Western Star Resources Inc.  is pleased to announce that it has entered into an investment and advisory agreement with Crescita Capital LLC.",
    "url": "/western-star-enters-agreement-with-crescita-capital"
  },
  {
    "id": 5,
    "title": "Western Star Resources Inc. Announces Acquisition of the Mt. Anderson Property in the Yukon",
    "date": "October 3, 2023",
    "content": "Western Star Resources Inc. is pleased to announce that it has entered into an agreement to acquire the Mount Anderson Property.",
    "url": "/western-star-enters-agreement-to-acquire-anderson"
  },
  {
    "id": 6,
    "title": "Western Star Resources Inc. Closes 100% Acquisition of Mount Anderson Property Yukon and Engages Black Swan Communication Services",
    "date": "October 18, 2023",
    "content": "Western Star Resources Inc. is pleased to announce the closing of the Mount Anderson Property in the Yukon.",
    "url": "/western-star-closes-anderson-acquisition"
  }
]
