[
    {
        "name": "Blake Morgan",
        "role": "CEO & Director",
        "description": "Mr. Morgan has over 15 years’ experience in Capital Markets, specifically in the Natural Resource and Precious Metals sector, including 10 years with Rio Tinto, BMA Metals (a subsidiary of BHP) and Santos Ltd.",
        "full_description": "Mr. Morgan has over 15 years’ experience in Capital Markets, specifically in the Natural Resource and Precious Metals sector, including 10 years with Rio Tinto, BMA Metals (a subsidiary of BHP) and Santos Ltd. Mr. Morgan is a prominent Board Member in numerous publicly traded companies. Mr. Morgan was the president of Origen Resources for numerous years recently stepping back once a world class board was put in place. Mr. Morgan has raised tens of millions of dollars in recent years for both Public and Private companies alike and has successfully taken numerous companies public in the United States, Canada, & Germany."
      },
      {
        "name": "Monty Sutton",
        "role": "CFO",
        "description": "Mr. Sutton has worked most of his career as an Investment Advisor, Equities Trader, and Insurance Specialist with PI Financial Corp in Vancouver. During this time, he participated in raising over $100m for junior mining companies and managed over 1,500 client accounts.",
        "full_description": "Mr. Sutton has worked most of his career as an Investment Advisor, Equities Trader, and Insurance Specialist with PI Financial Corp in Vancouver. During this time, he participated in raising over $100m for junior mining companies and managed over 1,500 client accounts. Since leaving PI, Mr. Sutton was the Corporate Development Manager with eCobalt Solutions where they raised over $30m for the companies Idaho Cobalt Project. Mr. Sutton has also been working with small private companies in various consulting and advisory roles. Prior to joining PI in 1997, Mr. Sutton was a Senior Management Accountant with MacMillan Bloedel; preparing budgets, analyzing costs, and assisting in the design and implementation of new accounting systems."
      },
      {
        "name": "Justin Corinella",
        "role": "Director",
        "description": "Mr. Corinella has a broad background in public markets and corporate financing. His focus is on early-stage venture companies with potential for large growth, scalability, and value creation.",
        "full_description": "Mr. Corinella has a broad background in public markets and corporate financing. His focus is on early-stage venture companies with potential for large growth, scalability, and value creation. Mr. Corinella was the Head of Technology for CSE listed Squire Mining Ltd., and as part of the executive team, he participated in raising $28m in financing, and developed strategic partnerships with key stakeholders in North America, Europe, and Asia. Mr. Corinella is the inventor and Co-founder of Dahrwin LLC. , Dahrwin is a wireless technology company based out of New York, founded in 2012. The company raised venture funding, spearheaded software & hardware development, and received five issued patents. His endeavors have positioned him as a lead in multiple R&D and Engineering departments working on various US military and government-based technologies."
      },
      {
        "name": "Dallas Miller",
        "role": "Director",
        "description": "Mr. Miller has been working with BHP and Santos Ltd. since 2010, both in Australia and in Papua New Guinea. He has extensive knowledge of the roles and responsibilities needed to take on and run a successful mining operation.",
        "full_description": "Mr. Miller has been working with BHP and Santos Ltd. since 2010, both in Australia and in Papua New Guinea. Mr. Miller has extensive knowledge of the roles and responsibilities needed to take on and run a successful mining operation. Mr. Miller has experience on the ground from an operational standpoint and has also been an integral part in raising millions of dollars in capital funding in recent years for both private and public companies. Mr. Miller is a prominent member of numerous public companies."
      }
  ]